# Handling Missing Data

In [1]:
#NAN values are replaced with mean average but if there are many NAN values then we delete that row
#2 methods: filling and filtering
#Redundant(Duplicate data) --> Remove it
#Replacing Values

In [11]:
import pandas as pd
import numpy as np
from numpy import nan as NA

'''dropna-> Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.
fillna-> Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
isnull-> Return boolean values indicating which values are missing/NA.
notnull-> Negation of isnull.'''

In [20]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull() #returns True where there is a NaN.

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
#The built-in Python None value is also treated as NA in object arrays
string_data[0]=None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
s1 = pd.Series([1,2,3,4,5,NA]) #NaN is imported as NA or use np.nan
s1.isnull() #returns true if there is nan.

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [22]:
s1[s1.isnull()]

5   NaN
dtype: float64

In [17]:
s1.notnull() #negation of isnull

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [18]:
s1.dropna() #drop nan value

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [23]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s

0    NaN
1    1.0
2    2.0
3    3.0
4    NaN
5    4.0
6    5.0
7    NaN
dtype: float64

In [29]:
s = s[s.notnull()] #notnull and dropna from these two we can remove nan values
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [33]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s.dropna(inplace=True)
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

## IN DATAFRAME

In [72]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [73]:
data.dropna() #cant be apply coz it removes whole row if NaN is there 
#in documentation how='any'-> if one is true then

     0    1    2
0  1.0  6.5  3.0

In [74]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [75]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [76]:
data.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [77]:
data.dropna(thresh=2,axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [78]:
data.iloc[:2,1] = NA
print(data)
data.dropna(thresh=2,axis=1)

     0    1    2
0  1.0  NaN  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [79]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.924931       NaN       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [80]:
df.fillna(0) #NaN->0

          0         1         2
0  1.924931  0.000000  0.000000
1  1.239036  0.000000  0.000000
2  2.111204  0.000000 -1.581941
3 -1.003755  0.000000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [81]:
df.fillna({1: 1,2: 2})

          0         1         2
0  1.924931  1.000000  2.000000
1  1.239036  1.000000  2.000000
2  2.111204  1.000000 -1.581941
3 -1.003755  1.000000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [82]:
df.fillna({1: df[1].mean(),2: df[1].mean()})

          0         1         2
0  1.924931  0.732586  0.732586
1  1.239036  0.732586  0.732586
2  2.111204  0.732586 -1.581941
3 -1.003755  0.732586 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [83]:
df.fillna(method='ffill')

          0         1         2
0  1.924931       NaN       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [84]:
df.iloc[:1,1] = 1.1 
df.fillna(method='ffill')

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.100000 -1.581941
3 -1.003755  1.100000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [85]:
df.fillna(method='bfill')

          0         1         2
0  1.924931  1.100000 -1.581941
1  1.239036  3.935089 -1.581941
2  2.111204  3.935089 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [87]:
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204       NaN -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [88]:
df[1][2] = 1.2
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [89]:
df.fillna(method='ffill')

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755  1.200000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [90]:
df.fillna(method='bfill')

          0         1         2
0  1.924931  1.100000 -1.581941
1  1.239036  1.200000 -1.581941
2  2.111204  1.200000 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [92]:
df

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036       NaN       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755       NaN -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [93]:
df.fillna(method='ffill',limit=1)

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.100000       NaN
2  2.111204  1.200000 -1.581941
3 -1.003755  1.200000 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [94]:
df.fillna(method='bfill',limit=1)

          0         1         2
0  1.924931  1.100000       NaN
1  1.239036  1.200000 -1.581941
2  2.111204  1.200000 -1.581941
3 -1.003755  3.935089 -0.489202
4  1.015840  3.935089  0.698068
5 -0.172678 -0.873615 -0.676439
6 -1.936520 -0.863716  2.244961

In [112]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [96]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [101]:
data.duplicated() #dono columns lerha hai one 1 , two 1 not duplicate,,, but two 4 , two 4 duplicate
#or data.duplicated(['k1','k2'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [102]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [104]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [103]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [113]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [117]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [118]:
meat_to_animal = {
 'bacon': 'cow',
 'pulled pork': 'goat',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'goat',
 'nova lox': 'salmon'
}
meat_to_animal['bacon']

'cow'

In [119]:
data['food'].str.upper()

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [120]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

## map

In [121]:
a = lambda x:x.upper()
lowercased.map(a) #map is not applied on dataframe we use apply map then

0          BACON
1    PULLED PORK
2          BACON
3       PASTRAMI
4    CORNED BEEF
5          BACON
6       PASTRAMI
7      HONEY HAM
8       NOVA LOX
Name: food, dtype: object

In [122]:
data['animal'] = lowercased.map(meat_to_animal) 

data

          food  ounces  animal
0        bacon     4.0     cow
1  pulled pork     3.0    goat
2        bacon    12.0     cow
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     cow
6     pastrami     3.0     cow
7    honey ham     5.0    goat
8     nova lox     6.0  salmon

In [138]:
mydata = pd.DataFrame({'name':['mids','hash','mar','max','fari','wari']})
mydata

   name
0  mids
1  hash
2   mar
3   max
4  fari
5  wari

In [139]:
name_to_age = {
    'mids' : 20,
    'hash' : 18,
    'mar':19,
    'max':19,
    'fari':19,
    'wari':17,
}

In [140]:
mydata['age'] = mydata['name'].map(name_to_age)
mydata

   name  age
0  mids   20
1  hash   18
2   mar   19
3   max   19
4  fari   19
5  wari   17

In [141]:
name_to_ageindex = {
    0 : 20,
    1 : 18,
    2:19,
    3:19,
    4:19,
    5:17,
}

In [142]:
mydata['age'] = mydata.index.map(name_to_ageindex)
mydata

   name  age
0  mids   20
1  hash   18
2   mar   19
3   max   19
4  fari   19
5  wari   17

# Replace

In [146]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [147]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [148]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [149]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [152]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [154]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [158]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [157]:
data.rename(index={'OHIO': 'INDIANA'}, 
columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

# 30/11/2019

## REPLACING VALUES

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [4]:
data.replace(-999.0,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [8]:
data.replace([1.,2.],np.nan)

0       NaN
1    -999.0
2       NaN
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [9]:
data.replace([1.,2.],3)

0       3.0
1    -999.0
2       3.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [10]:
data.replace([1.,2.],[2.3,4.4]) #using list to replace values

0       2.3
1    -999.0
2       4.4
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [11]:
data.replace({-999.0:np.nan,-1000.0:2000}) #using a dictionary

0       1.0
1       NaN
2       2.0
3       NaN
4    2000.0
5       3.0
dtype: float64

In [24]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [25]:
transform = lambda x: x[:4].upper()
print(data.index.map(transform)) #transform is a lambda fn , x=index
data.index = data.index.map(transform) #in map we have passed a lambda function
data

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [15]:
transform1 = lambda x: x[:4].upper()
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [32]:
data = data.rename(index = str.title,columns = str.upper)
data

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [33]:
data.rename(index={"Ohio":"INDIANA"},columns={"THREE":"pekaboo"})

         ONE  TWO  pekaboo  FOUR
INDIANA    0    1        2     3
Colo       4    5        6     7
New        8    9       10    11

## DISCRETIZATION AND BINNING

In [34]:
2(ages first parameter) ---> 1-4
7(bins second parameter) ---> 5-9
#pd.cut(single value,interval)
ages = [20,22,25,27,21,23,37,31,61,45,41,32] 
bins = [18,25,35,60,100]
#(18,25),(25,35),(35,60),(60,100)

In [36]:
cats = pd.cut(ages,bins) #(18, 25] 18 is not included ,25 is included...
#( <-closed , ] <- open
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [37]:
cats.codes #interval ka index

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [38]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [41]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [44]:
group_names = ['Youth','YoungAdult','Adult','MiddleAge']

In [45]:
pd.cut(ages,[18,26,36,61,100],labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Adult, Adult, Adult, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < Adult < MiddleAge]

In [46]:
data = np.random.rand(20)
data

array([0.35494687, 0.40259957, 0.4372818 , 0.38162375, 0.60173664,
       0.24629104, 0.15551816, 0.37374171, 0.55643146, 0.00363967,
       0.25440328, 0.05656665, 0.38414287, 0.86111355, 0.90358354,
       0.41613086, 0.35339726, 0.8890031 , 0.32565039, 0.05524197])

In [49]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    1.172931  0.361594 -1.214188  0.669591
1   -0.383343  0.507007 -0.788230  1.254328
2   -0.073158  0.087545 -0.947964 -0.766480
3    0.423254  0.752801  0.169817  1.101473
4    2.714332  0.529010 -1.219675  1.183980
5   -1.845744  0.011105  0.201750 -0.449220
6   -1.734288  1.132560  0.324289 -2.403080
7    1.133376  1.077327  0.768684  1.712920
8   -0.899052 -1.661770  0.403683 -1.078685
9   -0.437838 -1.113381 -0.293330 -0.326473
10  -0.254404  0.209664  1.126697  0.313005
11  -0.609729 -0.832192  0.484628  0.156861
12  -0.106360 -1.241751  0.921234  0.143403
13   1.078892 -0.468132 -0.865599  2.372627
14   0.923117 -0.435527  0.208665 -0.600280
15  -0.186167 -0.873532  0.393729  1.433881
16   2.057533 -0.415806 -1.164142 -1.823388
17   0.531311  0.285781  0.436394  0.765775
18  -0.665797  0.131822  1.294980  1.434074
19   0.947576  0.131291  1.140790 -2.173536
20  -0.019187 -1.980429 -0.556203  0.352141
21   0.785625  0.828453  1.156841  0.546322
22   0.294286  0.130008  0.637855  0.976921
23  -0.028091  1.196498  0.223475  1.294853
24   1.063711 -1.936588  1.588278 -0.787788
25   0.106270  1.421164  1.307593  0.841942
26  -0.324245  0.077018 -0.131241 -0.032960
27   0.495979  1.860895 -1.353477 -0.417881
28   0.497241  0.073201  0.119409  0.512855
29  -1.185068  1.063161 -0.955973  0.511289
..        ...       ...       ...       ...
970 -0.200058  0.287791 -0.413156  0.764359
971 -1.787582 -0.169035  0.050065 -2.394978
972  0.627189 -0.424561  0.536474  0.890979
973 -3.351063 -0.907782  0.791665  1.233012
974  0.546317  1.656692 -2.378800 -0.429466
975 -1.831444  3.277302  0.667863 -0.520857
976 -0.280260 -0.463214  0.180381  0.015609
977 -0.078248 -0.932560  2.709304 -0.211832
978 -0.688190  0.352433  0.057700  0.046123
979 -0.680344  0.437046  0.006286  1.235798
980 -1.633911 -1.054000 -0.986123  0.515547
981  0.888590 -0.357782 -0.286360 -1.568329
982 -0.581919 -0.182640 -0.678076  0.841936
983  0.508493  0.405541  1.944038 -0.732569
984  0.574830  1.428052  0.105792  1.081006
985  1.645901 -0.621192  0.365545 -0.076999
986 -0.307233  1.000045  1.598022  0.833219
987 -1.274979  0.388318  0.317390 -1.312369
988  0.976037 -0.425386 -0.933677 -0.234400
989  1.002820 -0.102131 -0.198444 -0.079187
990  0.154501 -0.323372 -1.500854  0.327157
991 -0.657360 -0.232122  1.382035 -0.328142
992 -1.289979  0.296214  1.161507 -0.303593
993  0.754916  0.223318 -1.574112 -1.695688
994  0.685019  0.248611 -0.090738 -0.615257
995  0.108584  0.563622  0.208885 -0.746592
996 -1.634086 -1.910866 -0.935857 -0.218593
997 -0.896744  0.769704  0.514403 -0.055016
998  0.138977 -0.284932  0.220100  1.176682
999 -1.001598 -1.423993 -0.001977  1.105723

[1000 rows x 4 columns]

In [50]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.061545    -0.012492     0.005412    -0.000362
std       0.974817     0.971602     1.030667     0.960320
min      -3.351063    -2.938197    -3.282844    -3.061684
25%      -0.635346    -0.704832    -0.722011    -0.673036
50%       0.078829    -0.014526     0.060256     0.007602
75%       0.729734     0.654189     0.663968     0.661036
max       2.866436     3.277302     2.994155     3.131956

In [52]:
col = data.head(10)
col

          0         1         2         3
0  1.172931  0.361594 -1.214188  0.669591
1 -0.383343  0.507007 -0.788230  1.254328
2 -0.073158  0.087545 -0.947964 -0.766480
3  0.423254  0.752801  0.169817  1.101473
4  2.714332  0.529010 -1.219675  1.183980
5 -1.845744  0.011105  0.201750 -0.449220
6 -1.734288  1.132560  0.324289 -2.403080
7  1.133376  1.077327  0.768684  1.712920
8 -0.899052 -1.661770  0.403683 -1.078685
9 -0.437838 -1.113381 -0.293330 -0.326473

In [69]:
var = np.abs(col)
var

          0         1         2         3
0  1.172931  0.361594  1.214188  0.669591
1  0.383343  0.507007  0.788230  1.254328
2  0.073158  0.087545  0.947964  0.766480
3  0.423254  0.752801  0.169817  1.101473
4  2.714332  0.529010  1.219675  1.183980
5  1.845744  0.011105  0.201750  0.449220
6  1.734288  1.132560  0.324289  2.403080
7  1.133376  1.077327  0.768684  1.712920
8  0.899052  1.661770  0.403683  1.078685
9  0.437838  1.113381  0.293330  0.326473

In [72]:
var>=1

       0      1      2      3
0   True  False   True  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False   True
4   True  False   True   True
5   True  False  False  False
6   True   True  False   True
7   True   True  False   True
8  False   True  False   True
9  False   True  False  False

In [84]:
np.abs(col) >= 1

       0      1      2      3
0   True  False   True  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False   True
4   True  False   True   True
5   True  False  False  False
6   True   True  False   True
7   True   True  False   True
8  False   True  False   True
9  False   True  False  False

In [78]:
col[np.abs(col >= 1)]

          0         1   2         3
0  1.172931       NaN NaN       NaN
1       NaN       NaN NaN  1.254328
2       NaN       NaN NaN       NaN
3       NaN       NaN NaN  1.101473
4  2.714332       NaN NaN  1.183980
5       NaN       NaN NaN       NaN
6       NaN  1.132560 NaN       NaN
7  1.133376  1.077327 NaN  1.712920
8       NaN       NaN NaN       NaN
9       NaN       NaN NaN       NaN

In [80]:
col[np.abs(col >= 1).any(1)]

          0         1         2         3
0  1.172931  0.361594 -1.214188  0.669591
1 -0.383343  0.507007 -0.788230  1.254328
3  0.423254  0.752801  0.169817  1.101473
4  2.714332  0.529010 -1.219675  1.183980
6 -1.734288  1.132560  0.324289 -2.403080
7  1.133376  1.077327  0.768684  1.712920

In [83]:
col[np.abs(col >= 1).all(1)]

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [82]:
np.sign(col) 
#jahan positive wahan 1.0 jidhar negative udhar -1.0

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1 -1.0  1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0 -1.0  1.0
5 -1.0  1.0  1.0 -1.0
6 -1.0  1.0  1.0 -1.0
7  1.0  1.0  1.0  1.0
8 -1.0 -1.0  1.0 -1.0
9 -1.0 -1.0 -1.0 -1.0

# Permutation and Random Sampling

In [87]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [92]:
sampler = np.random.permutation(5)
sampler

array([1, 3, 2, 0, 4])

In [93]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [98]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3

In [101]:
df.sample(n=4)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [104]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [105]:
pd.get_dummies(df['key']) #[a,b,c]

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [119]:
np.random.seed(1) #freeze
values = np.random.rand(1) 
values

array([0.00011437])

## SPLIT , JOIN , STRIP

In [126]:
val = '  a,b,  guido  '
val.split(",")

['  a', 'b', '  guido  ']

In [127]:
val.strip()

'a,b,  guido'

In [128]:
pieces = [x.strip() for x in val.split(',')] #by default strip is whitespace
pieces

['a', 'b', 'guido']

In [147]:
myjoin = " midha ".join(pieces)
myjoin

'a midha b midha guido'

In [150]:
myjoin.strip("a midha")

'b midha guido'

In [136]:
myjoin.index('midha') #index of first midha

2

In [154]:
#myjoin.index('MIDHA')  
myjoin.find('MIDHA') # it will give -1 when false not error when substring not found

-1

In [138]:
"midha" in myjoin

True

In [152]:
str = "*****this is string***example....wow!!!*****"
print (str.strip( '*' ))

this is string***example....wow!!!

In [1]:
import re
text = "foo    bar\t baz \tqux"
#normal split = text.split()
#re.split('\s+', text) # spliting based on whitespaces
#text.split(" ")
#['foo', 'bar', 'baz', 'qux']
# compile once to use again and again and save time
rgx = re.compile('\s+')
rgx.split(text)

['foo', 'bar', 'baz', 'qux']